{
  "courses": [
    {
      "id": "MATH140",
      "prerequisites": [],
      "semester": 1,
      "completed": true,
      "vertical_position": 0,
      "credits": "4",
      "description": "Introduction to calculus, including functions, limits, continuity, derivatives and applications of the derivative, sketching of graphs of functions, definite and indefinite integrals, and calculation of area. The course is especially recommended for science, engineering and mathematics majors."
    },
    {
      "id": "MATH141",
      "prerequisites": [],
      "semester": 1,
      "completed": true,
      "vertical_position": 1,
      "credits": "4",
      "description": "Continuation of MATH140, including techniques of integration, improper integrals, applications of integration (such as volumes, work, arc length, moments), inverse functions, exponential and logarithmic functions, sequences and series."
    },
    {
      "id": "STAT400",
      "prerequisites": [],
      "semester": 2,
      "completed": false,
      "vertical_position": 0,
      "credits": "3",
      "description": "Random variables, standard distributions, moments, law of large numbers and central limit theorem. Sampling methods, estimation of parameters, testing of hypotheses."
    },
    {
      "id": "CMSC131",
      "prerequisites": [],
      "semester": 1,
      "completed": true,
      "vertical_position": 2,
      "credits": "4",
      "description": "Introduction to programming and computer science. Emphasizes understanding and implementation of applications using object-oriented techniques. Develops skills such as program design and testing as well as implementation of programs using a graphical IDE. Programming done in Java."
    },
    {
      "id": "CMSC132",
      "prerequisites": [],
      "semester": 1,
      "completed": true,
      "vertical_position": 3,
      "credits": "4",
      "description": "Introduction to use of computers to solve problems using software engineering principles. Design, build, test, and debug medium -size software systems and learn to use relevant tools. Use object-oriented methods to create effective and efficient problem solutions. Use and implement application programming interfaces (APIs). Programming done in Java."
    },
    {
      "id": "CMSC216",
      "prerequisites": [
        "CMSC132"
      ],
      "semester": 3,
      "completed": false,
      "vertical_position": 2,
      "credits": "4",
      "description": "Introduction to the interaction between user programs and the operating system/hardware. Major topics include C programming, introductory systems programming, and assembly language. Other concepts covered include UNIX, machine data representation, thread management, optimization, and virtual memory. Programming is done in the Linux Environment."
    },
    {
      "id": "CMSC250",
      "prerequisites": [],
      "semester": 2,
      "completed": false,
      "vertical_position": 1,
      "credits": "4",
      "description": "Fundamental mathematical concepts related to computer science, including finite and infinite sets, relations, functions, and propositional logic. Introduction to other techniques, modeling and solving problems in computer science. Introduction to permutations, combinations, graphs, and trees with selected applications."
    },
    {
      "id": "CMSC330",
      "prerequisites": [
        "CMSC216",
        "MATH461"
      ],
      "semester": 4,
      "completed": false,
      "vertical_position": 0,
      "credits": "3",
      "description": "A study of programming languages, including their syntax, semantics, and implementation. Several different models of languages are discussed, including dynamic, scripting (e.g., Ruby, Python) functional (e.g., OCaml, Haskell, Scheme), and memory safe systems programming (e.g., Rust). Explores language features such as formal syntax, scoping and binding of variables, higher-order programming, typing, and type polymorphism. Introduces finite automata, context free grammar, parsing, lambda calculus, and basics of security attacks and software security."
    },
    {
      "id": "CMSC351",
      "prerequisites": [
        "CMSC216"
      ],
      "semester": 4,
      "completed": false,
      "vertical_position": 1,
      "credits": "3",
      "description": "A systematic study of the complexity of some elementary algorithms related to sorting, graphs and trees, and combinatorics. Algorithms are analyzed using mathematical techniques to solve recurrences and summations."
    },
    {
      "id": "CMSC320",
      "prerequisites": [
        "MATH140",
        "STAT400"
      ],
      "semester": 3,
      "completed": false,
      "vertical_position": 0,
      "credits": "3",
      "description": "An introduction to the data science pipeline, i.e., the end-to-end process of going from unstructured, messy data to knowledge and actionable insights. Provides a broad overview of several topics including statistical data analysis, basic data mining and machine learning algorithms, large-scale data management, cloud computing, and information visualization."
    },
    {
      "id": "MATH461",
      "prerequisites": [
        "CMSC250"
      ],
      "semester": 3,
      "completed": false,
      "vertical_position": 1,
      "credits": "3",
      "description": "Basic concepts of linear algebra. This course is similar to MATH240, but with more extensive coverage of the topics needed in applied linear algebra: change of basis, complex eigenvalues, diagonalization, the Jordan canonical form."
    },
    {
      "id": "CMSC422",
      "prerequisites": [
        "CMSC330",
        "CMSC351"
      ],
      "semester": 5,
      "completed": false,
      "vertical_position": 0,
      "credits": "3",
      "description": "Machine Learning studies representations and algorithms that allow machines to improve their performance on a task from experience. This is a broad overview of existing methods for machine learning and an introduction to adaptive systems in general. Emphasis is given to practical aspects of machine learning and data mining."
    },
    {
      "id": "CMSC426",
      "prerequisites": [
        "CMSC330",
        "CMSC351",
        "MATH461"
      ],
      "semester": 5,
      "completed": false,
      "vertical_position": 2,
      "credits": "3",
      "description": "An introduction to basic concepts and techniques in computervision. This includes low-level operations such as image filtering and edge detection, 3D reconstruction of scenes using stereo and structure from motion, and object detection, recognition and classification."
    },
    {
      "id": "CMSC470",
      "prerequisites": [
        "CMSC320",
        "CMSC330",
        "CMSC351",
        "MATH461"
      ],
      "semester": 5,
      "completed": false,
      "vertical_position": 1,
      "credits": "3",
      "description": "Introduction to fundamental techniques for automatically processing and generating natural language with computers. Machine learning techniques, models, and algorithms that enable computers to deal with the ambiguity and implicit structure of natural language. Application of these techniques in a series of assignments designed to address a core application such as question answering or machine translation."
    },
    {
      "id": "CMSC435",
      "prerequisites": [
        "CMSC426"
      ],
      "semester": 6,
      "completed": false,
      "vertical_position": 1,
      "credits": "3",
      "description": "State-of-the-art techniques in software design and development. Laboratory experience in applying the techniques covered. Structured design, structured programming, top-down design and development, segmentation and modularization techniques, iterative enhancement, design and code inspection techniques, correctness, and chief-programmer teams. The development of a large software project."
    },
    {
      "id": "MATH401",
      "prerequisites": [
        "CMSC330",
        "CMSC351",
        "MATH461"
      ],
      "semester": 5,
      "completed": false,
      "vertical_position": 3,
      "credits": "3",
      "description": "Various applications of linear algebra: theory of finite games, linear programming, matrix methods as applied to finite Markov chains, random walk, incidence matrices, graphs and directed graphs, networks and transportation problems."
    },
    {
      "id": "CMSC460",
      "prerequisites": [
        "CMSC422"
      ],
      "semester": 6,
      "completed": false,
      "vertical_position": 0,
      "credits": "3",
      "description": "Basic computational methods for interpolation, least squares, approximation, numerical quadrature, numerical solution of polynomial and transcendental equations, systems of linear equations and initial value problems for ordinary differential equations. Emphasis on methods and their computational properties rather than their analytic aspects. Intended primarily for students in the physical and engineering sciences."
    }
  ]
}